tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/wallBoiling1D_3phase/0/k.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            mapped;
        field           k.liquid;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 0.01;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 3.75e-05;
        value           uniform 0.01;
    }
    wall1
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    wall2
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
